---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModule.GetEnumerator
source: html/6c8ce9f0-c84a-625d-c7fe-66eb5345c31d.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Macro> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.